repository/resources/perf-test/results/siddhiesb_results_round2.txt
Warm-up ...
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		9.566941 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		10,452.66 [#/sec] (mean)
Time per request:		9.567 [ms] (mean)
Time per request:		0.096 [ms] (mean, across all concurrent requests)
Transfer rate:			20,403.60 [Kbytes/sec] received
				20,403.60 kb/s sent
				40,807.19 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.372444 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,793.18 [#/sec] (mean)
Time per request:		11.372 [ms] (mean)
Time per request:		0.114 [ms] (mean, across all concurrent requests)
Transfer rate:			17,164.30 [Kbytes/sec] received
				17,164.30 kb/s sent
				34,328.59 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		10.256975 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,749.46 [#/sec] (mean)
Time per request:		10.257 [ms] (mean)
Time per request:		0.103 [ms] (mean, across all concurrent requests)
Transfer rate:			19,030.95 [Kbytes/sec] received
				19,030.95 kb/s sent
				38,061.90 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.503056 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,693.34 [#/sec] (mean)
Time per request:		11.503 [ms] (mean)
Time per request:		0.115 [ms] (mean, across all concurrent requests)
Transfer rate:			16,969.40 [Kbytes/sec] received
				16,969.40 kb/s sent
				33,938.81 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.269967 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,535.81 [#/sec] (mean)
Time per request:		13.270 [ms] (mean)
Time per request:		0.133 [ms] (mean, across all concurrent requests)
Transfer rate:			14,709.91 [Kbytes/sec] received
				14,709.91 kb/s sent
				29,419.82 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		9.612629 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		10,402.98 [#/sec] (mean)
Time per request:		9.613 [ms] (mean)
Time per request:		0.096 [ms] (mean, across all concurrent requests)
Transfer rate:			20,306.62 [Kbytes/sec] received
				20,306.62 kb/s sent
				40,613.24 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.565734 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,646.23 [#/sec] (mean)
Time per request:		11.566 [ms] (mean)
Time per request:		0.116 [ms] (mean, across all concurrent requests)
Transfer rate:			16,877.44 [Kbytes/sec] received
				16,877.44 kb/s sent
				33,754.88 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.766998 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,498.34 [#/sec] (mean)
Time per request:		11.767 [ms] (mean)
Time per request:		0.118 [ms] (mean, across all concurrent requests)
Transfer rate:			16,588.77 [Kbytes/sec] received
				16,588.77 kb/s sent
				33,177.53 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.353251 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,095.04 [#/sec] (mean)
Time per request:		12.353 [ms] (mean)
Time per request:		0.124 [ms] (mean, across all concurrent requests)
Transfer rate:			15,801.51 [Kbytes/sec] received
				15,801.51 kb/s sent
				31,603.02 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.789053 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,482.45 [#/sec] (mean)
Time per request:		11.789 [ms] (mean)
Time per request:		0.118 [ms] (mean, across all concurrent requests)
Transfer rate:			16,557.73 [Kbytes/sec] received
				16,557.73 kb/s sent
				33,115.47 kb/s total
Warmup Completed!
Warm-up ...
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.639744 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,591.25 [#/sec] (mean)
Time per request:		11.640 [ms] (mean)
Time per request:		0.116 [ms] (mean, across all concurrent requests)
Transfer rate:			16,770.13 [Kbytes/sec] received
				16,770.13 kb/s sent
				33,540.26 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.282302 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,141.80 [#/sec] (mean)
Time per request:		12.282 [ms] (mean)
Time per request:		0.123 [ms] (mean, across all concurrent requests)
Transfer rate:			15,892.79 [Kbytes/sec] received
				15,892.79 kb/s sent
				31,785.57 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		10.434035 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			99998
Total transferred:		390400000 bytes
Requests per second:		9,584.02 [#/sec] (mean)
Time per request:		10.434 [ms] (mean)
Time per request:		0.104 [ms] (mean, across all concurrent requests)
Transfer rate:			18,708.01 [Kbytes/sec] received
				18,708.01 kb/s sent
				37,416.01 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.043940 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			99871
Total transferred:		390400000 bytes
Requests per second:		7,666.40 [#/sec] (mean)
Time per request:		13.044 [ms] (mean)
Time per request:		0.130 [ms] (mean, across all concurrent requests)
Transfer rate:			14,964.80 [Kbytes/sec] received
				14,964.80 kb/s sent
				29,929.61 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.842132 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			99994
Total transferred:		390400000 bytes
Requests per second:		7,786.87 [#/sec] (mean)
Time per request:		12.842 [ms] (mean)
Time per request:		0.128 [ms] (mean, across all concurrent requests)
Transfer rate:			15,199.97 [Kbytes/sec] received
				15,199.97 kb/s sent
				30,399.94 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.356164 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,093.13 [#/sec] (mean)
Time per request:		12.356 [ms] (mean)
Time per request:		0.124 [ms] (mean, across all concurrent requests)
Transfer rate:			15,797.78 [Kbytes/sec] received
				15,797.78 kb/s sent
				31,595.57 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.335657 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,106.58 [#/sec] (mean)
Time per request:		12.336 [ms] (mean)
Time per request:		0.123 [ms] (mean, across all concurrent requests)
Transfer rate:			15,824.05 [Kbytes/sec] received
				15,824.05 kb/s sent
				31,648.09 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		10.388728 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,625.82 [#/sec] (mean)
Time per request:		10.389 [ms] (mean)
Time per request:		0.104 [ms] (mean, across all concurrent requests)
Transfer rate:			18,789.60 [Kbytes/sec] received
				18,789.60 kb/s sent
				37,579.19 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.808252 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,242.05 [#/sec] (mean)
Time per request:		13.808 [ms] (mean)
Time per request:		0.138 [ms] (mean, across all concurrent requests)
Transfer rate:			14,136.47 [Kbytes/sec] received
				14,136.47 kb/s sent
				28,272.95 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/noapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.296258 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,520.91 [#/sec] (mean)
Time per request:		13.296 [ms] (mean)
Time per request:		0.133 [ms] (mean, across all concurrent requests)
Transfer rate:			14,680.82 [Kbytes/sec] received
				14,680.82 kb/s sent
				29,361.65 kb/s total
Warmup Completed!
===== CBR Proxy =====
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		14.037474 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,123.79 [#/sec] (mean)
Time per request:		14.037 [ms] (mean)
Time per request:		0.140 [ms] (mean, across all concurrent requests)
Transfer rate:			13,905.64 [Kbytes/sec] received
				13,905.64 kb/s sent
				27,811.27 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.522612 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,395.02 [#/sec] (mean)
Time per request:		13.523 [ms] (mean)
Time per request:		0.135 [ms] (mean, across all concurrent requests)
Transfer rate:			14,435.08 [Kbytes/sec] received
				14,435.08 kb/s sent
				28,870.16 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.556876 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,963.76 [#/sec] (mean)
Time per request:		12.557 [ms] (mean)
Time per request:		0.126 [ms] (mean, across all concurrent requests)
Transfer rate:			15,545.27 [Kbytes/sec] received
				15,545.27 kb/s sent
				31,090.54 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.427783 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			99988
Total transferred:		390400000 bytes
Requests per second:		8,750.60 [#/sec] (mean)
Time per request:		11.428 [ms] (mean)
Time per request:		0.114 [ms] (mean, across all concurrent requests)
Transfer rate:			17,081.18 [Kbytes/sec] received
				17,081.18 kb/s sent
				34,162.36 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.955058 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			99917
Total transferred:		390400000 bytes
Requests per second:		8,364.66 [#/sec] (mean)
Time per request:		11.955 [ms] (mean)
Time per request:		0.120 [ms] (mean, across all concurrent requests)
Transfer rate:			16,327.82 [Kbytes/sec] received
				16,327.82 kb/s sent
				32,655.63 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.677314 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			99986
Total transferred:		390400000 bytes
Requests per second:		8,563.61 [#/sec] (mean)
Time per request:		11.677 [ms] (mean)
Time per request:		0.117 [ms] (mean, across all concurrent requests)
Transfer rate:			16,716.17 [Kbytes/sec] received
				16,716.17 kb/s sent
				33,432.35 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.354241 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,488.26 [#/sec] (mean)
Time per request:		13.354 [ms] (mean)
Time per request:		0.134 [ms] (mean, across all concurrent requests)
Transfer rate:			14,617.08 [Kbytes/sec] received
				14,617.08 kb/s sent
				29,234.16 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.362475 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,089.00 [#/sec] (mean)
Time per request:		12.362 [ms] (mean)
Time per request:		0.124 [ms] (mean, across all concurrent requests)
Transfer rate:			15,789.72 [Kbytes/sec] received
				15,789.72 kb/s sent
				31,579.44 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		10.755471 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,297.59 [#/sec] (mean)
Time per request:		10.755 [ms] (mean)
Time per request:		0.108 [ms] (mean, across all concurrent requests)
Transfer rate:			18,148.90 [Kbytes/sec] received
				18,148.90 kb/s sent
				36,297.81 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/hbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.886566 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,201.20 [#/sec] (mean)
Time per request:		13.887 [ms] (mean)
Time per request:		0.139 [ms] (mean, across all concurrent requests)
Transfer rate:			14,056.75 [Kbytes/sec] received
				14,056.75 kb/s sent
				28,113.50 kb/s total
=== Completed ===
===== CBR Proxy =====
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		18.147629 seconds
Complete requests:		99996
Failed requests:		4
Write errors:			0
Kept alive:			99996
Total transferred:		390384384 bytes
Requests per second:		5,510.14 [#/sec] (mean)
Time per request:		18.148 [ms] (mean)
Time per request:		0.181 [ms] (mean, across all concurrent requests)
Transfer rate:			10,755.79 [Kbytes/sec] received
				10,755.79 kb/s sent
				21,511.57 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		14.850816 seconds
Complete requests:		99995
Failed requests:		5
Write errors:			0
Kept alive:			99995
Total transferred:		390380480 bytes
Requests per second:		6,733.30 [#/sec] (mean)
Time per request:		14.852 [ms] (mean)
Time per request:		0.149 [ms] (mean, across all concurrent requests)
Transfer rate:			13,143.39 [Kbytes/sec] received
				13,143.39 kb/s sent
				26,286.77 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.946564 seconds
Complete requests:		99994
Failed requests:		6
Write errors:			0
Kept alive:			99994
Total transferred:		390376576 bytes
Requests per second:		7,169.79 [#/sec] (mean)
Time per request:		13.947 [ms] (mean)
Time per request:		0.139 [ms] (mean, across all concurrent requests)
Transfer rate:			13,995.42 [Kbytes/sec] received
				13,995.42 kb/s sent
				27,990.84 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		14.059377 seconds
Complete requests:		99997
Failed requests:		3
Write errors:			0
Kept alive:			99992
Total transferred:		390388288 bytes
Requests per second:		7,112.48 [#/sec] (mean)
Time per request:		14.060 [ms] (mean)
Time per request:		0.141 [ms] (mean, across all concurrent requests)
Transfer rate:			13,883.55 [Kbytes/sec] received
				13,883.55 kb/s sent
				27,767.09 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.276042 seconds
Complete requests:		99994
Failed requests:		6
Write errors:			0
Kept alive:			99994
Total transferred:		390376576 bytes
Requests per second:		7,531.91 [#/sec] (mean)
Time per request:		13.277 [ms] (mean)
Time per request:		0.133 [ms] (mean, across all concurrent requests)
Transfer rate:			14,702.27 [Kbytes/sec] received
				14,702.27 kb/s sent
				29,404.55 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.907528 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,747.42 [#/sec] (mean)
Time per request:		12.908 [ms] (mean)
Time per request:		0.129 [ms] (mean, across all concurrent requests)
Transfer rate:			15,122.96 [Kbytes/sec] received
				15,122.96 kb/s sent
				30,245.92 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.242435 seconds
Complete requests:		99999
Failed requests:		1
Write errors:			0
Kept alive:			99999
Total transferred:		390396096 bytes
Requests per second:		7,551.41 [#/sec] (mean)
Time per request:		13.243 [ms] (mean)
Time per request:		0.132 [ms] (mean, across all concurrent requests)
Transfer rate:			14,740.34 [Kbytes/sec] received
				14,740.34 kb/s sent
				29,480.68 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.084704 seconds
Complete requests:		99999
Failed requests:		1
Write errors:			0
Kept alive:			99999
Total transferred:		390396096 bytes
Requests per second:		8,274.84 [#/sec] (mean)
Time per request:		12.085 [ms] (mean)
Time per request:		0.121 [ms] (mean, across all concurrent requests)
Transfer rate:			16,152.49 [Kbytes/sec] received
				16,152.49 kb/s sent
				32,304.97 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.707268 seconds
Complete requests:		99999
Failed requests:		1
Write errors:			0
Kept alive:			99999
Total transferred:		390396096 bytes
Requests per second:		7,295.33 [#/sec] (mean)
Time per request:		13.707 [ms] (mean)
Time per request:		0.137 [ms] (mean, across all concurrent requests)
Transfer rate:			14,240.47 [Kbytes/sec] received
				14,240.47 kb/s sent
				28,480.95 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/cbrapi
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.737482 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,519.71 [#/sec] (mean)
Time per request:		11.737 [ms] (mean)
Time per request:		0.117 [ms] (mean, across all concurrent requests)
Transfer rate:			16,630.48 [Kbytes/sec] received
				16,630.48 kb/s sent
				33,260.97 kb/s total
=== Completed ===
===== Transform Proxy =====
Running iteration 0

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		15.548406 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		6,431.53 [#/sec] (mean)
Time per request:		15.548 [ms] (mean)
Time per request:		0.155 [ms] (mean, across all concurrent requests)
Transfer rate:			7,299.78 [Kbytes/sec] received
				12,554.34 kb/s sent
				19,854.13 kb/s total
Running iteration 1

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		19.203232 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		5,207.46 [#/sec] (mean)
Time per request:		19.203 [ms] (mean)
Time per request:		0.192 [ms] (mean, across all concurrent requests)
Transfer rate:			5,910.46 [Kbytes/sec] received
				10,164.96 kb/s sent
				16,075.42 kb/s total
Running iteration 2

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		15.483424 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		6,458.52 [#/sec] (mean)
Time per request:		15.483 [ms] (mean)
Time per request:		0.155 [ms] (mean, across all concurrent requests)
Transfer rate:			7,330.42 [Kbytes/sec] received
				12,607.03 kb/s sent
				19,937.45 kb/s total
Running iteration 3

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		17.091189 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		5,850.97 [#/sec] (mean)
Time per request:		17.091 [ms] (mean)
Time per request:		0.171 [ms] (mean, across all concurrent requests)
Transfer rate:			6,640.85 [Kbytes/sec] received
				11,421.09 kb/s sent
				18,061.94 kb/s total
Running iteration 4

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		17.706945 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		5,647.50 [#/sec] (mean)
Time per request:		17.707 [ms] (mean)
Time per request:		0.177 [ms] (mean, across all concurrent requests)
Transfer rate:			6,409.91 [Kbytes/sec] received
				11,023.92 kb/s sent
				17,433.84 kb/s total
Running iteration 5

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		15.732997 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		6,356.07 [#/sec] (mean)
Time per request:		15.733 [ms] (mean)
Time per request:		0.157 [ms] (mean, across all concurrent requests)
Transfer rate:			7,214.14 [Kbytes/sec] received
				12,407.04 kb/s sent
				19,621.18 kb/s total
Running iteration 6

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		17.414855 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		5,742.22 [#/sec] (mean)
Time per request:		17.415 [ms] (mean)
Time per request:		0.174 [ms] (mean, across all concurrent requests)
Transfer rate:			6,517.42 [Kbytes/sec] received
				11,208.82 kb/s sent
				17,726.25 kb/s total
Running iteration 7

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		17.504552 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		5,712.80 [#/sec] (mean)
Time per request:		17.505 [ms] (mean)
Time per request:		0.175 [ms] (mean, across all concurrent requests)
Transfer rate:			6,484.03 [Kbytes/sec] received
				11,151.39 kb/s sent
				17,635.41 kb/s total
Running iteration 8

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		16.342858 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		6,118.88 [#/sec] (mean)
Time per request:		16.343 [ms] (mean)
Time per request:		0.163 [ms] (mean, across all concurrent requests)
Transfer rate:			6,944.93 [Kbytes/sec] received
				11,944.06 kb/s sent
				18,888.98 kb/s total
Running iteration 9

Server Software:		Apache-Coyote/1.1
Server Hostname:		localhost
Server Port:			7070

Document Path:			http://localhost:7070/tranformapi
Document Length:		1135 bytes

Concurrency Level:		100
Time taken for tests:		16.195128 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		308700000 bytes
Requests per second:		6,174.70 [#/sec] (mean)
Time per request:		16.195 [ms] (mean)
Time per request:		0.162 [ms] (mean, across all concurrent requests)
Transfer rate:			7,008.28 [Kbytes/sec] received
				12,053.01 kb/s sent
				19,061.29 kb/s total
=== Completed ===